// Напишите программу, которая выводит третью цифру заданного числа и сообщает, что третьей цифры нет.
Console.WriteLine("Введите число: ");

